results/factorial-final/security-overhead-final-mtls-broker5/security-overhead-final-factorial-mtls-b5-rf3-isr3-msg10240-tps10000-batch131072-acks1-prod12-compnone-trial3/producer-perf-12.log
producer_index=12
producer_count=12
producer_records=8333
producer_throughput=833
1 records sent, 0.1 records/sec (0.00 MB/sec), 7044.0 ms avg latency, 7044.0 ms max latency.
552 records sent, 102.6 records/sec (1.00 MB/sec), 9016.0 ms avg latency, 18391.0 ms max latency.
1584 records sent, 312.1 records/sec (3.05 MB/sec), 11237.6 ms avg latency, 13538.0 ms max latency.
1944 records sent, 388.3 records/sec (3.79 MB/sec), 10335.4 ms avg latency, 15098.0 ms max latency.
2076 records sent, 412.0 records/sec (4.02 MB/sec), 8012.1 ms avg latency, 9253.0 ms max latency.
8333 records sent, 199.492471 records/sec (1.95 MB/sec), 8791.57 ms avg latency, 18391.00 ms max latency, 8279 ms 50th, 12452 ms 95th, 13983 ms 99th, 15027 ms 99.9th.